cf/Documents/Обращение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Обращение</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийОтчетОбработка1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конфигурация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
						<v8:Type>cfg:CatalogRef.Функции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВнешниеОтчетыИОбработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВнешняяОбработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВнешниеОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеФункции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Функция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзмененияФункции</v8:Type>
								<v8:Type>cfg:CatalogRef.Функции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Enums/КатегорииОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КатегорииОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИзменениеВнешнихОтчётовИОбработок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеКонфигурацииБезПодтвержденияОдобрения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/Обращение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	
	Если ПоказыватьСписок = Истина Тогда
		
		Элементы.ВнешнийОтчетОбработка.Видимость = Ложь;
		Элементы.ВнешниеОтчетыИОбработки.Видимость = Истина;
		
	Иначе
		
		Если Объект.ВнешниеОтчетыИОбработки.Количество() Тогда
			Оповещение = Новый ОписаниеОповещения("ОчисткаСписка", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, "Список обработок будет очищен. Продолжить?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет, НСтр("ru = 'Очистка списка обработок'"));
		Иначе 
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаСписка(Ответ, ПараметрыВыполнения) Экспорт
	
	Если Ответ <> -1 Тогда
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			ПерваяСтрока = Объект.ВнешниеОтчетыИОбработки[0];
			
			Объект.ВнешниеОтчетыИОбработки.Очистить();
			НоваяСтрока = Объект.ВнешниеОтчетыИОбработки.Добавить();
			НоваяСтрока.ВнешняяОбработка = ПерваяСтрока.ВнешняяОбработка;
			
			ВнешнийОтчетОбработка = ПерваяСтрока.ВнешняяОбработка;
			
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
		    Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
			
		Иначе
			
			ПоказыватьСписок = Истина;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиПоКатегории();
	
	Если Лев(Объект.ОписаниеHTML,5) = "<html" Тогда
		Элементы.ОписаниеHTML.Вид = ВидПоляФормы.ПолеHTMLДокумента;
	Иначе
		Элементы.ОписаниеHTML.Вид = ВидПоляФормы.ПолеТекстовогоДокумента;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВнешнийОтчетОбработкаПриИзменении(Элемент)
	
	Объект.ВнешниеОтчетыИОбработки.Очистить();
	НоваяСтрока = Объект.ВнешниеОтчетыИОбработки.Добавить();
	НоваяСтрока.ВнешняяОбработка = ВнешнийОтчетОбработка;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиПоКатегории()

	Если ЭтоНовый Тогда
		Элементы.Категория.ТолькоПросмотр = Ложь;
	КонецЕсли; 
	
	Если Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорииОбращений.ИзменениеКонфигурации") ИЛИ Объект.Категория = ПредопределенноеЗначение("Перечисление.КатегорииОбращений.ИзменениеКонфигурацииБезПодтвержденияОдобрения") Тогда
		Элементы.ГруппаВнешниеОбработки.Видимость = Ложь;
		Элементы.Состояние.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ГруппаВнешниеОбработки.Видимость = Истина;
		Элементы.Состояние.ТолькоПросмотр = Истина;
		//Элементы.ФормаКнопка3.Видимость = Ложь;
		Если Объект.ВнешниеОтчетыИОбработки.Количество() > 1 Тогда
			ПоказыватьСписок = Истина;
			Элементы.ВнешнийОтчетОбработка.Видимость = Ложь;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Истина;
		Иначе
			Если Объект.ВнешниеОтчетыИОбработки.Количество() > 0 Тогда
				ВнешнийОтчетОбработка = Объект.ВнешниеОтчетыИОбработки[0].ВнешняяОбработка;
			КонецЕсли; 
			Элементы.ВнешнийОтчетОбработка.Видимость = Истина;
			Элементы.ВнешниеОтчетыИОбработки.Видимость = Ложь;
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры // ()

&НаКлиенте
Процедура КатегорияОткрытие(Элемент, СтандартнаяОбработка)
	Если ТИ.ДоступнаРоль("ПолныеПрава") ИЛИ ТИ.ДоступнаРоль("Разработчик") Тогда
		Элементы.Категория.ТолькоПросмотр = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	УправлениеЭлементамиПоКатегории()
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЭтоНовый = Объект.Ссылка.Пустая();
КонецПроцедуры
